ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_НоменклатураПоставщиков/ЖБИ_НоменклатураПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_НоменклатураПоставщиков</name>
  <comment>ЖБИ - Номенклатура поставщиков</comment>
  <resources>
    <name>ПунктОтгрузки</name>
    <comment>Пункт отгрузки</comment>
    <type>
      <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
    </type>
  </resources>
  <resources>
    <name>СтатусОсторожно</name>
    <comment>Осторожно</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МаркировкаОбщепринятая</name>
    <comment>Маркировка общепринятая</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасширенноеНаименование</name>
    <comment>Расширенное наименование</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормативныйДокумент</name>
    <comment>Норматив. документ</comment>
    <type>
      <types>CatalogRef.ЖБИ_НормативныеДокументы</types>
    </type>
  </resources>
  <resources>
    <name>НормаАвто</name>
    <comment>Норма погрузки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Качество</name>
    <comment>Качество</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <comment>Вес, т</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <comment>Объем м3</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <comment>Длина мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиаметрММ</name>
    <comment>Диаметр мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтверстиеММ</name>
    <comment>Отверстие, мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиаметрВх</name>
    <comment>Диаметр вх. мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиаметрВых</name>
    <comment>Диаметр вых. мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РабочаяДлина</name>
    <comment>Рабочая длин. мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаСтенки</name>
    <comment>Толщина стенки мм.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Глубина</name>
    <comment>Глубина, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШиринаМакс</name>
    <comment>Шир. макс, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШиринаМин</name>
    <comment>Шир. мин, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВысотаМакс</name>
    <comment>Высота, макс, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВысотаМин</name>
    <comment>Высота, мин, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Армирование</name>
    <comment>Армирование</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БетонВ</name>
    <comment>Бетон, В</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВодонепрW</name>
    <comment>Водонепр. W</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МорозF</name>
    <comment>Мороз. F</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СертифицированДо</name>
    <comment>Сертифицирован до</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Негабаритный</name>
    <comment>Не габарит</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КолВУпаковке</name>
    <comment>Кол-во в упаковке, шт</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесАвто</name>
    <comment>Вес в авто, т</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Направление</name>
    <comment>Направление</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <comment>Коментарий</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мощность</name>
    <comment>Производственные мощности, шт./м2</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаПаузе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <comment>Дата обновления</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <comment>Поставщик</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПоставщика</name>
    <comment>Номенклатура поставщика</comment>
    <type>
      <types>CatalogRef.НоменклатураПоставщиков</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_ПрайслистПоставщика/ЖБИ_ПрайслистПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_ПрайслистПоставщика</name>
  <comment>ЖБИ - Прайс поставщика</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <comment>Цена с НДС</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПредыдущаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущаяЦена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <comment>Поставщик</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПоставщика</name>
    <comment>Номенклатура поставщика</comment>
    <type>
      <types>CatalogRef.НоменклатураПоставщиков</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="09a12ed1-441d-49a8-9f36-2093735e8d37">
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1b521724-19bd-43e6-b544-b67dc4ba22b9">
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЖБИ_ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_АртикулДляСайта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ВыгружатьНаСайт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ЕстьСертификатТаможенногоСоюза</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ЕстьНаСкладе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ОписаниеГруппы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ОписаниеГруппы1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="344b6917-b413-4fae-aadd-d62836822de6">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="3ebfaae7-710d-4b97-aff3-149de91a4f89">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c122409e-0e2f-4354-a036-4e8f6440b616">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЖБИ_УТ11.РасширениеЖБИ/src/Catalogs/НоменклатураПоставщиков/НоменклатураПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураПоставщиков</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖБИ_НеИспользуется</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_НоменклатураПоставщиков/Forms/ФормаЗаписи/Module.bsl
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

&НаСервере
Процедура ЗаполнитьКарточуНоменклатуры()
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	КарточкаНоменклатуры.Очистить();
	НастройкиВидимостиИЗаголовков 	= Справочники.Номенклатура.НастройкиВидимостиИЗаголовков(Номенклатура, Ложь);
	КарточкаНоменклатуры 			= Справочники.Номенклатура.ТабличныйДокументКарточкиНоменклатуры(Номенклатура, НастройкиВидимостиИЗаголовков);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьНоменклатуруСопоставления(НоменклатураПоставщика,Номенклатура,Очистить = Ложь,СообщениеОбОшибки = "")
	
	Отказ = Ложь;
	
	СпрОбъект = НоменклатураПоставщика.ПолучитьОбъект();
	Если Очистить Тогда
		СпрОбъект.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	Иначе 
		СпрОбъект.Номенклатура = Номенклатура;
	КонецЕсли;
	
	Попытка
		СпрОбъект.Записать();
	Исключение
		Отказ = Истина;
		СообщениеОбОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Отказ;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьНоменклатуруПоставщикаКопированием(НоменклатураПоставщика,ЦенаНоменклатурыКопирование,Поставщик,Номенклатура,Отказ = Ложь,СообщениеОбОшибки = "")
	
	Артикул = НоменклатураПоставщика.Артикул;
	СпрНоменклатураПоставщикаСсылка = Справочники.НоменклатураПоставщиков.НайтиПоРеквизиту("Артикул",Артикул,,Поставщик);
	Если СпрНоменклатураПоставщикаСсылка.Ссылка.Пустая() Тогда
		
		НачатьТранзакцию();
		
		//1 создать новую карточку номенклатуры поставщика
		СпрОбъект 				= Справочники.НоменклатураПоставщиков.СоздатьЭлемент();
		СпрОбъект.Владелец 		= Поставщик;
		СпрОбъект.Наименование 	= НоменклатураПоставщика.Наименование;
		СпрОбъект.Артикул 		= Артикул;
		СпрОбъект.Номенклатура  = Номенклатура;
		СпрОбъект.УстановитьНовыйКод();	
		Попытка
			СпрОбъект.Записать();
		Исключение
			Отказ = Истина;
			СообщениеОбОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		СпрНоменклатураПоставщикаСсылка = СпрОбъект.Ссылка;
		
		//2 создать новую цену поставщика
		ТаблицаНабораЗаписей = РегистрыСведений.ЖБИ_ПрайслистПоставщика.ПолучитьПустуюТаблицуНаборЗаписей();
		НоваяСтр = ТаблицаНабораЗаписей.Добавить();	
		НоваяСтр.Период					= ТекущаяДатаСеанса();
		НоваяСтр.Партнер 				= Поставщик;
		НоваяСтр.НоменклатураПоставщика = СпрНоменклатураПоставщикаСсылка;
		НоваяСтр.Цена					= ЦенаНоменклатурыКопирование;
		НоваяСтр.Автор 					= Пользователи.ТекущийПользователь();
		
		//получим пред. цену и дату
		РегистрыСведений.ЖБИ_ПрайслистПоставщика.ЗаполнитьПредыдущуюЦену(ТаблицаНабораЗаписей,Поставщик);
		
		Результат 						= РегистрыСведений.ЖБИ_ПрайслистПоставщика.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,,, СообщениеОбОшибки);
		Если Не Результат Тогда
			Отказ = Истина;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
	Возврат СпрНоменклатураПоставщикаСсылка;
	
КонецФункции

&НаКлиенте
Процедура РассчитатьВесАвтоИОбъем()  
	
	//ВесЧислитель = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Номенклатура,"ВесЧислитель");
	//Если ВесЧислитель <> Неопределено
	//	И ВесЧислитель>0 Тогда 
	//	Запись.ВесАвто 	= ВесЧислитель*Запись.НормаАвто;
	//КонецЕсли; 
	
	Запись.ВесАвто = Запись.Вес * Запись.НормаАвто;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНоменклатуруСопоставления()	
	Номенклатура 	= "";	
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ

&НаКлиенте
Процедура ВесПриИзменении(Элемент)	
	РассчитатьВесАвтоИОбъем();
КонецПроцедуры

&НаКлиенте
Процедура НормаАвтоПриИзменении(Элемент)
	РассчитатьВесАвтоИОбъем();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПоставщикаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда 	
		Текст = "Будет очищена номенклатура сопоставления: "+Номенклатура+"?";
		СтруктураСобытия = Новый Структура("ИмяСобытия","ВопросОчиститьНоменклатуруСопоставления");
		ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтаФорма, СтруктураСобытия);
		ПоказатьВопрос(ОписаниеОповещения,Текст,РежимДиалогаВопрос.ДаНет,15);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)	
		
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	
	СообщениеОбОшибки = "";
	Отказ = Ложь;
	Если ЗначениеЗаполнено(НоменклатураПоставщикаКопирование)
		И ЗначениеЗаполнено(Запись.Партнер) Тогда
		НоменклатураПоставщика = ЗаполнитьНоменклатуруПоставщикаКопированием(НоменклатураПоставщикаКопирование,ЦенаНоменклатурыКопирование,Запись.Партнер,Номенклатура,Отказ,СообщениеОбОшибки);
		
		Если Отказ Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СообщениеОбОшибки;
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		
		Запись.НоменклатураПоставщика = НоменклатураПоставщика;
		Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Отказ = Ложь;
	СообщениеОбОшибки = "";
	Если ЗначениеЗаполнено(ЭтотОбъект[Элемент.Имя]) Тогда
		Отказ = ЗаполнитьНоменклатуруСопоставления(Запись.НоменклатураПоставщика,Номенклатура,Ложь,СообщениеОбОшибки);
	Иначе 
		Отказ = ЗаполнитьНоменклатуруСопоставления(Запись.НоменклатураПоставщика,Номенклатура,Истина,СообщениеОбОшибки);
	КонецЕсли;	
	
	Если Отказ Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СообщениеОбОшибки;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Параметры.Свойство("ЭтоКопирование") Тогда
		ЗаполнитьЗначенияСвойств(Запись, Параметры);
	КонецЕсли;
	
	Артикул				= Запись.НоменклатураПоставщика.Артикул;
	Номенклатура 		= Запись.НоменклатураПоставщика.Номенклатура;
	ГруппаНоменклатуры	= Номенклатура.Родитель;	
	ОбщийВес 			= Запись.НормаАвто*Запись.Вес;	
	Если Не Параметры.ЗначениеКопирования.НоменклатураПоставщика.Пустая() Тогда 
		НоменклатураПоставщикаКопирование 	= Параметры.ЗначениеКопирования.НоменклатураПоставщика;
		ЦенаНоменклатурыКопирование			= РегистрыСведений.ЖБИ_ПрайслистПоставщика.ПолучитьАктуальнуюЦенуПоставщика(Запись.Партнер,Запись.НоменклатураПоставщика);
	КонецЕсли;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Запись.Автор 		= ТекущийПользователь;
	
	ЗаполнитьКарточуНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(Результат, ДополнительныеПараметры) Экспорт
	
	РезультатВыполнения = Новый Структура("СообщениеОбОшибке","");	
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда 
		Если ДополнительныеПараметры.Свойство("ИмяСобытия")
			И ЗначениеЗаполнено(ДополнительныеПараметры.ИмяСобытия) Тогда	
			Если ДополнительныеПараметры.ИмяСобытия = "ВопросОчиститьНоменклатуруСопоставления" Тогда 
				Если Результат = КодВозвратаДиалога.Нет ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
					Возврат;
				КонецЕсли;
				ОчиститьНоменклатуруСопоставления();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти
